Revit 2027 API
ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) Constructor
 Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves other
)
Public Sub New (
	other As ClosestPointsPairBetweenTwoCurves
)
public:
ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves^ other
)
new :
        other : ClosestPointsPairBetweenTwoCurves -> ClosestPointsPairBetweenTwoCurves
Parameters
other ClosestPointsPairBetweenTwoCurves
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
ClosestPointsPairBetweenTwoCurves Overload
Autodesk.Revit.DB Namespace